# Intro to Pandas LIbrary

The pandas library consist mostly of two data types:
- Series
- DataFrames: A 2D object to represent `tabular` data

# DataFrames Characteristics
- Mutable
- Index based
- A full class

## Classic data representation formats
- JSON
- CSV

In [3]:
import pandas as pd

In [5]:
# Create a new DataFrame
df_one = pd.DataFrame(columns=['Column1', 'Column2'])
df_one

Empty DataFrame
Columns: [Column1, Column2]
Index: []

In [6]:
# Another Way
df_one.columns = ['First', 'Second']
df_one

Empty DataFrame
Columns: [First, Second]
Index: []

In [7]:
# Add some rows
data1 = {
    'First':[1, 2, 'Real'],    # key = column, values = list of data
    'Second':[22, 44, 'Madrid']
}
# Create new df with data
df_two = pd.DataFrame(data1)
df_two

  First  Second
0     1      22
1     2      44
2  Real  Madrid

In [8]:
# Combine two dfs
df_three = pd.concat([df_one, df_two])
df_three

  First  Second
0     1      22
1     2      44
2  Real  Madrid

In [15]:
# Add data to df_one
data = {
    'FIrst':[66, 77, 'Hello'],
    'Second':[88, 99, 'CS4580']
}
# Add it to frame
df_one = pd.DataFrame(data)
# Combine them
df_three = pd.concat([df_one, df_two])

   FIrst  Second First
0     66      88   NaN
1     77      99   NaN
2  Hello  CS4580   NaN
0    NaN      22     1
1    NaN      44     2
2    NaN  Madrid  Real

In [10]:
# Update indexes as you combine them
df_three.reset_index(drop=True, inplace=True)
df_three

  First  Second
0     1      22
1     2      44
2  Real  Madrid

In [16]:
# Add df column-wise
col_data = {
    'Third': [88, 99, 11]
}
df_four = pd.DataFrame(col_data)
# Now combine them by columns, add the axis=1 parameter
df_combined = pd.concat([df_three, df_four], axis=1)
df_combined

   FIrst  Second First  Third
0     66      88   NaN     88
1     77      99   NaN     99
2  Hello  CS4580   NaN     11
0    NaN      22     1     88
1    NaN      44     2     99
2    NaN  Madrid  Real     11

## Task: Sales Data

### TODO: Define a df called df sales with two columns: Date, Amount

### TODO: Add sample data: 3 rows

### TODO: Create a new df with two more rows of data, same columns as df_sales

### TODO: Combine them, and make sure indexes are correct

### TODO: Add a new column called: 'Product' with 4 rows of data, and combine it to original df_sales

In [17]:
# TODO: Define a df called df sales with two columns: Date, Amount

df_sales = pd.DataFrame(columns=['Date', 'Amount'])
print(df_sales)

Empty DataFrame
Columns: [Date, Amount]
Index: []

In [18]:
# TODO: Add sample data: 3 rows

sales_data = {
    'Date':['3/6/89', '9/27/81', '11/9/95'],    # key = column, values = list of data
    'Amount':[22, 44, 88]
}

In [19]:
# TODO: Create a new df with two more rows of data, same columns as df_sales

df_SalesNew = pd.DataFrame(sales_data)
sales_data2 = {
    'Date':['5/11/90', '3/1/88'],
    'Amount':[45, 76]
}
df_sales = pd.concat([df_sales, df_SalesNew], ignore_index=True)
print(df_sales)

  Date Amount  Data
0  NaN     22   1.0
1  NaN     44   2.0
2  NaN     88   3.0

In [20]:
# TODO: Combine them, and make sure indexes are correct

df_sales = pd.concat([df_sales, df_SalesNew])
df_sales

# Reset the Index
df_sales.reset_index(drop=True, inplace=True)
df_sales

NameError: name 'df_SalesNew' is not defined

In [ ]:
# TODO: Add a new column called: 'Product' with 4 rows of data, and combine it to original df_sales
new_column = pd.DataFrame({'Product':['A', 'B', 'C']})
df_sales['Product'] = new_column
df_sales

## Working with JSON Files
You can handle JSON files directly with Pandas, using the `read_json` method

In [1]:
import pandas as pd

# Load JSON File
df_json_data = pd.read_json('../data/example-1.json')

In [2]:
# Display df
df_json_data

   Column 1  Column 2
0         1         2
1         3         4
2         5         6

In [3]:
#Convert dataFrame to json formatted string
json_format = df_json_data.to_json()
json_format

'{"Column 1":{"0":1,"1":3,"2":5},"Column 2":{"0":2,"1":4,"2":6}}'

## Working with CSV Files
With Pandas use the `read_csv()` method

In [4]:
df_csv_format = pd.read_csv('../data/example-1.csv')
# Display it
df_csv_format

     Branch       Date  Amount
0  Branch A  January 1   500.0
1  Branch B  January 2   250.0
2  Branch A  January 3   300.0

In [8]:
# Read file without header record
df_csv_format = pd.read_csv('../data/example-1.csv', header=None)
df_csv_format

          0          1       2
0    Branch       Date  Amount
1  Branch A  January 1  500.00
2  Branch B  January 2  250.00
3  Branch A  January 3  300.00

In [7]:
# Save the data back to csv file
# If you do not need the index information, use, index=None
df_csv_format.to_csv('test.csv', index=None)